ChenDudo/MM32-eMiniBoard-Demo/lib/HAL_lib/inc/hal_eth.h
////////////////////////////////////////////////////////////////////////////////
/// @file     HAL_eth.h
/// @author   LiuYQ (liuyunqing@mindmotion.com.cn)
/// @version  v2.0.0
/// @date     2019-07-30
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE HAL_eth.h EXAMPLES.
/// ////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT 2018-2019 MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

#ifndef __HAL_ETH_H
#define __HAL_ETH_H

// Files includes
#include "types.h"
#include "mm32_device.h"
#include "HAL_eth_conf.h"

////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ETH     | Header | Extra | VLAN tag | Payload   | CRC |
// Size    | 14     | 2     | 4        | 46 ~ 1500 | 4   |
#define ETH_MAX_PACKET_SIZE     1524
#define ETH_HEADER              14      ///< MAC Dest Addr 6 byte + MAC Src Addr 6 byte + Lenth/Type 2 byte
#define ETH_EXTRA               2
#define VLAN_TAG                4
#define ETH_PAYLOAD_MIN         46
#define ETH_PAYLOAD_MAX         1500
#define JUMBO_FRAME_PAYLOAD     9000

#ifndef ETH_RX_BUF_SIZE
#define ETH_RX_BUF_SIZE     ETH_MAX_PACKET_SIZE
#endif

#ifndef ETH_RX_BUF_NUM
#define ETH_RX_BUF_NUM      4
#endif

#ifndef ETH_TX_BUF_SIZE
#define ETH_TX_BUF_SIZE     ETH_MAX_PACKET_SIZE
#endif

#ifndef ETH_TX_BUF_NUM
#define ETH_TX_BUF_NUM      4
#endif

#define ETH_DMA_RDES_FL_Pos     16                                              ///< Ethernet DMA Received Frame Length Position

#define ETH_WAKEUP_REGISTER_LENGTH                          8                   ///< ETHERNET Remote Wake-up frame register length

#define ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT       17                  ///< ETHERNET Missed frames counter Shift

#define ETH_DMA_TDES_COLLISION_COUNTSHIFT                   3                   ///< ETHERNET DMA Tx descriptors Collision Count Shift
#define ETH_DMA_TDES_BUFFER2_SIZESHIFT                      11                  ///< ETHERNET DMA Tx descriptors Buffer2 Size Shift

#define ETH_DMA_RDES_FRAME_LENGTHSHIFT                      16                  ///< ETHERNET DMA Rx descriptors Frame Length Shift
#define ETH_DMA_RDES_BUFFER2_SIZESHIFT                      11                  ///< ETHERNET DMA Rx descriptors Buffer2 Size Shift

///< ETHERNET errors
#define  ETH_ERROR                                          ((uint32_t)0)
#define  ETH_SUCCESS                                        ((uint32_t)1)


#ifdef _HAL_ETH_C_
#define GLOBAL

#else
#define GLOBAL extern
#endif


////////////////////////////////////////////////////////////////////////////////
/// @brief ETH Init Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32    ETH_AutoNegotiation;
    __IO u32    ETH_Watchdog;
    __IO u32    ETH_Jabber;
    __IO u32    ETH_InterFrameGap;
    __IO u32    ETH_CarrierSense;
    __IO u32    ETH_Speed;
    __IO u32    ETH_ReceiveOwn;
    __IO u32    ETH_LoopbackMode;
    __IO u32    ETH_Mode;
    __IO u32    ETH_ChecksumOffload;
    __IO u32    ETH_RetryTransmission;
    __IO u32    ETH_AutomaticPadCRCStrip;
    __IO u32    ETH_BackOffLimit;
    __IO u32    ETH_DeferralCheck;
    __IO u32    ETH_ReceiveAll;
    __IO u32    ETH_SourceAddrFilter;
    __IO u32    ETH_PassControlFrames;
    __IO u32    ETH_BroadcastFramesReception;
    __IO u32    ETH_DestinationAddrFilter;
    __IO u32    ETH_PromiscuousMode;
    __IO u32    ETH_MulticastFramesFilter;
    __IO u32    ETH_UnicastFramesFilter;
    __IO u32    ETH_HashTableHigh;
    __IO u32    ETH_HashTableLow;
    __IO u32    ETH_PauseTime;
    __IO u32    ETH_ZeroQuantaPause;
    __IO u32    ETH_PauseLowThreshold;
    __IO u32    ETH_UnicastPauseFrameDetect;
    __IO u32    ETH_ReceiveFlowControl;
    __IO u32    ETH_TransmitFlowControl;
    __IO u32    ETH_VLANTagComparison;
    __IO u32    ETH_VLANTagIdentifier;
    __IO u32    ETH_DropTCPIPChecksumErrorFrame;
    __IO u32    ETH_ReceiveStoreForward;
    __IO u32    ETH_FlushReceivedFrame;
    __IO u32    ETH_TransmitStoreForward;
    __IO u32    ETH_TransmitThresholdControl;
    __IO u32    ETH_ForwardErrorFrames;
    __IO u32    ETH_ForwardUndersizedGoodFrames;
    __IO u32    ETH_ReceiveThresholdControl;
    __IO u32    ETH_SecondFrameOperate;
    __IO u32    ETH_AddressAlignedBeats;
    __IO u32    ETH_FixedBurst;
    __IO u32    ETH_RxDMABurstLength;
    __IO u32    ETH_TxDMABurstLength;
    __IO u32    ETH_DescriptorSkipLength;
    __IO u32    ETH_DMAArbitration;
} ETH_InitTypeDef;

typedef struct {
    __IO u32   CS;                                                              ///< Control and Status
    __IO u32   BL;                                                              ///< Buffer1, Buffer2 lengths
    __IO u32   BUF1ADDR;                                                        ///< Buffer1 address pointer
    __IO u32   BUF2NDADDR;                                                      ///< Buffer2 or next descriptor address pointer

#ifdef USE_ENHANCED_DMA_DESCRIPTORS                                             ///< Enhanced ETHERNET DMA PTP Descriptors
    __IO u32        ExtendedStatus;                                             ///< Extended status for PTP receive descriptor
    __IO u32        Reserved1;                                                  ///< Reserved
    __IO u32        TimeStampLow;                                               ///< Time Stamp Low value for transmit and receive
    __IO u32        TimeStampHigh;                                              ///< Time Stamp High value for transmit and receive
#endif
} ETH_DMADESCTypeDef;

