ChenDudo/MM32-eMiniBoard-Demo/lib/HAL_lib/inc/hal_eth.h
typedef struct {
    __IO u32                         len;
    __IO u32                         buf;
    __IO ETH_DMADESCTypeDef*    ptrDesc;
} FrameTypeDef;

typedef struct  {
    __IO ETH_DMADESCTypeDef*    ptrFS_Rx_Desc;                                  ///< First Segment Rx Desc
    __IO ETH_DMADESCTypeDef*    ptrLS_Rx_Desc;                                  ///< Last Segment Rx Desc
    __IO uint32_t               cnt;                                            ///< Segment count
} ETH_DMA_Rx_Frame_infos;




///???xhm:以下注释的内容不只从何得知
#define ETH_DMA_TDES_OWN                     ((uint32_t)0x80000000)             ///< OWN bit: descriptor is owned by DMA engine
#define ETH_DMA_TDES_ES                      ((uint32_t)0x00008000)             ///< Error summary: OR of the following bits: UE || ED || EC || LCO || NC || LCA || FF || JT
#define ETH_DMA_TDES_JT                      ((uint32_t)0x00004000)             ///< Jabber Timeout
#define ETH_DMA_TDES_FF                      ((uint32_t)0x00002000)             ///< Frame Flushed: DMA/MTL flushed the frame due to SW flush
#define ETH_DMA_TDES_LCA                     ((uint32_t)0x00000800)             ///< Loss of Carrier: carrier lost during transmission
#define ETH_DMA_TDES_NC                      ((uint32_t)0x00000400)             ///< No Carrier: no carrier signal from the transceiver
#define ETH_DMA_TDES_LCO                     ((uint32_t)0x00000200)             ///< Late Collision: transmission aborted due to collision
#define ETH_DMA_TDES_EC                      ((uint32_t)0x00000100)             ///< Excessive Collision: transmission aborted after 16 collisions
#define ETH_DMA_TDES_VF                      ((uint32_t)0x00000080)             ///< VLAN Frame
#define ETH_DMA_TDES_CC                      ((uint32_t)0x00000078)             ///< Collision Count
#define ETH_DMA_TDES_ED                      ((uint32_t)0x00000004)             ///< Excessive Deferral
#define ETH_DMA_TDES_UF                      ((uint32_t)0x00000002)             ///< Underflow Error: late data arrival from the memory
#define ETH_DMA_TDES_DB                      ((uint32_t)0x00000001)             ///< Deferred Bit

#define ETH_DMA_TDES_IC                      ((uint32_t)0x80000000)             ///< Interrupt on Completion
#define ETH_DMA_TDES_LS                      ((uint32_t)0x40000000)             ///< Last Segment
#define ETH_DMA_TDES_FS                      ((uint32_t)0x20000000)             ///< First Segment
#define ETH_DMA_TDES_DC                      ((uint32_t)0x04000000)             ///< Disable CRC
#define ETH_DMA_TDES_TER                     ((uint32_t)0x02000000)             ///< Transmit end of ring
#define ETH_DMA_TDES_TCH                     ((uint32_t)0x01000000)             ///< Second Address Chained
#define ETH_DMA_TDES_DP                      ((uint32_t)0x00800000)             ///< Disable Padding
#define ETH_DMA_TDES_TBS2                    ((uint32_t)0x003FF800)             ///< Transmit Buffer 2 Size
#define ETH_DMA_TDES_TBS1                    ((uint32_t)0x000007FF)             ///< Transmit Buffer 1 Size

#define ETH_DMA_TDES_B1AP                    ((uint32_t)0xFFFFFFFF)             ///< Buffer 1 Address Pointer

#define ETH_DMA_TDES_B2AP                    ((uint32_t)0xFFFFFFFF)             ///< Buffer 2 Address Pointer

#if defined(USE_ENHANCED_DMA_DESCRIPTORS)
#define ETH_DMA_PTP_TDES_TTSL                ((uint32_t)0xFFFFFFFF)              ///< Transmit Time Stamp Low
#define ETH_DMA_PTP_TDES_TTSH                ((uint32_t)0xFFFFFFFF)              ///< Transmit Time Stamp High
#endif

#define ETH_DMA_RDES_OWN                     ((uint32_t)0x80000000)             ///< OWN bit: descriptor is owned by DMA engine
#define ETH_DMA_RDES_AFM                     ((uint32_t)0x40000000)             ///< DA Filter Fail for the rx frame
#define ETH_DMA_RDES_FL                      ((uint32_t)0x3FFF0000)             ///< Receive descriptor frame length
#define ETH_DMA_RDES_ES                      ((uint32_t)0x00008000)             ///< Error summary: OR of the following bits: DE || OE || IPC || LC || RWT || RE || CE
#define ETH_DMA_RDES_DE                      ((uint32_t)0x00004000)             ///< Descriptor error: no more descriptors for receive frame
#define ETH_DMA_RDES_SAF                     ((uint32_t)0x00002000)             ///< SA Filter Fail for the received frame
#define ETH_DMA_RDES_LE                      ((uint32_t)0x00001000)             ///< Frame size not matching with length field
#define ETH_DMA_RDES_OE                      ((uint32_t)0x00000800)             ///< Overflow Error: Frame was damaged due to buffer overflow
#define ETH_DMA_RDES_VLAN                    ((uint32_t)0x00000400)             ///< VLAN Tag: received frame is a VLAN frame
#define ETH_DMA_RDES_FS                      ((uint32_t)0x00000200)             ///< First descriptor of the frame
#define ETH_DMA_RDES_LS                      ((uint32_t)0x00000100)             ///< Last descriptor of the frame
#define ETH_DMA_RDES_IPV4HCE                 ((uint32_t)0x00000080)             ///< IPC Checksum Error: Rx Ipv4 header checksum error
#define ETH_DMA_RDES_LC                      ((uint32_t)0x00000040)             ///< Late collision occurred during reception
#define ETH_DMA_RDES_FT                      ((uint32_t)0x00000020)             ///< Frame type - Ethernet, otherwise 802.3
#define ETH_DMA_RDES_RWT                     ((uint32_t)0x00000010)             ///< Receive Watchdog Timeout: watchdog timer expired during reception
#define ETH_DMA_RDES_RE                      ((uint32_t)0x00000008)             ///< Receive error: error reported by MII interface
#define ETH_DMA_RDES_DBE                     ((uint32_t)0x00000004)             ///< Dribble bit error: frame contains non int multiple of 8 bits
#define ETH_DMA_RDES_CE                      ((uint32_t)0x00000002)             ///< CRC error
#define ETH_DMA_RDES_MAMPCE                  ((uint32_t)0x00000001)             ///< Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum Error

#define ETH_DMA_RDES_DIC                     ((uint32_t)0x80000000)             ///< Disable Interrupt on Completion
#define ETH_DMA_RDES_RER                     ((uint32_t)0x02000000)             ///< Receive End of Ring
#define ETH_DMA_RDES_RCH                     ((uint32_t)0x01000000)             ///< Second Address Chained
#define ETH_DMA_RDES_RBS2                    ((uint32_t)0x003FF800)             ///< Receive Buffer2 Size
#define ETH_DMA_RDES_RBS1                    ((uint32_t)0x000007FF)             ///< Receive Buffer1 Size

#define ETH_DMA_RDES_B1AP                    ((uint32_t)0xFFFFFFFF)             ///< Buffer 1 Address Pointer

#define ETH_DMA_RDES_B2AP                    ((uint32_t)0xFFFFFFFF)             ///< Buffer 2 Address Pointer


#if defined(USE_ENHANCED_DMA_DESCRIPTORS)
#define ETH_DMA_PTP_RDES_PTPV                            ((uint32_t)0x00002000)  ///< PTP Version
#define ETH_DMA_PTP_RDES_PTPFT                           ((uint32_t)0x00001000)  ///< PTP Frame Type
#define ETH_DMA_PTP_RDES_PTPMT                           ((uint32_t)0x00000F00)  ///< PTP Message Type
#define ETH_DMA_PTP_RDES_PTPMT_Sync                      ((uint32_t)0x00000100)  ///< SYNC message (all clock types)
#define ETH_DMA_PTP_RDES_PTPMT_FollowUp                  ((uint32_t)0x00000200)  ///< FollowUp message (all clock types)
#define ETH_DMA_PTP_RDES_PTPMT_DelayReq                  ((uint32_t)0x00000300)  ///< DelayReq message (all clock types)
#define ETH_DMA_PTP_RDES_PTPMT_DelayResp                 ((uint32_t)0x00000400)  ///< DelayResp message (all clock types)
#define ETH_DMA_PTP_RDES_PTPMT_PdelayReq_Announce        ((uint32_t)0x00000500)  ///< PdelayReq message (peer-to-peer transparent clock) or Announce message (Ordinary or Boundary clock)
#define ETH_DMA_PTP_RDES_PTPMT_PdelayResp_Manag          ((uint32_t)0x00000600)  ///< PdelayResp message (peer-to-peer transparent clock) or Management message (Ordinary or Boundary clock)
#define ETH_DMA_PTP_RDES_PTPMT_PdelayRespFollowUp_Signal ((uint32_t)0x00000700)  ///< PdelayRespFollowUp message (peer-to-peer transparent clock) or Signaling message (Ordinary or Boundary clock)
#define ETH_DMA_PTP_RDES_IPV6PR                          ((uint32_t)0x00000080)  ///< IPv6 Packet Received
#define ETH_DMA_PTP_RDES_IPV4PR                          ((uint32_t)0x00000040)  ///< IPv4 Packet Received
#define ETH_DMA_PTP_RDES_IPCB                            ((uint32_t)0x00000020)  ///< IP Checksum Bypassed
#define ETH_DMA_PTP_RDES_IPPE                            ((uint32_t)0x00000010)  ///< IP Payload Error
#define ETH_DMA_PTP_RDES_IPHE                            ((uint32_t)0x00000008)  ///< IP Header Error
#define ETH_DMA_PTP_RDES_IPPT                            ((uint32_t)0x00000007)  ///< IP Payload Type
#define ETH_DMA_PTP_RDES_IPPT_UDP                        ((uint32_t)0x00000001)  ///< UDP payload encapsulated in the IP datagram
#define ETH_DMA_PTP_RDES_IPPT_TCP                        ((uint32_t)0x00000002)  ///< TCP payload encapsulated in the IP datagram
#define ETH_DMA_PTP_RDES_IPPT_ICMP                       ((uint32_t)0x00000003)  ///< ICMP payload encapsulated in the IP datagram



#define ETH_DMA_PTP_RDES_TTSL               ((uint32_t)0xFFFFFFFF)              ///< Receive Time Stamp Low
#define ETH_DMA_PTP_RDES_TTSH               ((uint32_t)0xFFFFFFFF)              ///< Receive Time Stamp High
#endif

////////////////////////////////////////////////////////////////////////////////
#define PHY_READ_TIMEOUT                    ((uint32_t)0x0004FFFF)
#define PHY_WRITE_TIMEOUT                   ((uint32_t)0x0004FFFF)

#define PHY_BCR                             0                                   ///< Transceiver Basic Control Register
#define PHY_BSR                             1                                   ///< Transceiver Basic Status Register

