ChenDudo/MM32-eMiniBoard-Demo/lib/HAL_lib/inc/hal_eth.h
#define ETH_UnicastPauseFrameDetect_Enable              ((uint32_t)0x00000008)
#define ETH_UnicastPauseFrameDetect_Disable             ((uint32_t)0x00000000)

#define ETH_ReceiveFlowControl_Enable                   ((uint32_t)0x00000004)
#define ETH_ReceiveFlowControl_Disable                  ((uint32_t)0x00000000)

#define ETH_TransmitFlowControl_Enable                  ((uint32_t)0x00000002)
#define ETH_TransmitFlowControl_Disable                 ((uint32_t)0x00000000)

#define ETH_VLANTagComparison_12Bit                     ((uint32_t)0x00010000)
#define ETH_VLANTagComparison_16Bit                     ((uint32_t)0x00000000)

#define ETH_MAC_FLAG_TST                                ((uint32_t)0x00000200)              ///< Time stamp trigger flag (on MAC)
#define ETH_MAC_FLAG_MMCT                               ((uint32_t)0x00000040)              ///< MMC transmit flag
#define ETH_MAC_FLAG_MMCR                               ((uint32_t)0x00000020)              ///< MMC receive flag
#define ETH_MAC_FLAG_MMC                                ((uint32_t)0x00000010)              ///< MMC flag (on MAC)
#define ETH_MAC_FLAG_PMT                                ((uint32_t)0x00000008)              ///< PMT flag (on MAC)

#define ETH_MAC_IT_TST                                  ((uint32_t)0x00000200)              ///< Time stamp trigger interrupt (on MAC)
#define ETH_MAC_IT_MMCT                                 ((uint32_t)0x00000040)              ///< MMC transmit interrupt
#define ETH_MAC_IT_MMCR                                 ((uint32_t)0x00000020)              ///< MMC receive interrupt
#define ETH_MAC_IT_MMC                                  ((uint32_t)0x00000010)              ///< MMC interrupt (on MAC)
#define ETH_MAC_IT_PMT                                  ((uint32_t)0x00000008)              ///< PMT interrupt (on MAC)

#define ETH_MAC_Address0                                ((uint32_t)0x00000000)
#define ETH_MAC_Address1                                ((uint32_t)0x00000008)
#define ETH_MAC_Address2                                ((uint32_t)0x00000010)
#define ETH_MAC_Address3                                ((uint32_t)0x00000018)

#define ETH_MAC_AddressFilter_SA                        ((uint32_t)0x00000000)
#define ETH_MAC_AddressFilter_DA                        ((uint32_t)0x00000008)

#define ETH_MAC_AddressMask_Byte6                       ((uint32_t)0x20000000)              ///< Mask MAC Address high reg bits [15:8]
#define ETH_MAC_AddressMask_Byte5                       ((uint32_t)0x10000000)              ///< Mask MAC Address high reg bits [7:0]
#define ETH_MAC_AddressMask_Byte4                       ((uint32_t)0x08000000)              ///< Mask MAC Address low reg bits [31:24]
#define ETH_MAC_AddressMask_Byte3                       ((uint32_t)0x04000000)              ///< Mask MAC Address low reg bits [23:16]
#define ETH_MAC_AddressMask_Byte2                       ((uint32_t)0x02000000)              ///< Mask MAC Address low reg bits [15:8]
#define ETH_MAC_AddressMask_Byte1                       ((uint32_t)0x01000000)              ///< Mask MAC Address low reg bits [70]

////////////////////////////////////////////////////////////////////////////////
#define ETH_DMA_TDES_LastSegment                        ((uint32_t)0x40000000)              ///< Last Segment
#define ETH_DMA_TDES_FirstSegment                       ((uint32_t)0x20000000)              ///< First Segment

#define ETH_DMA_TDES_ChecksumByPass                     ((uint32_t)0x00000000)      ///< Checksum engine bypass
#define ETH_DMA_TDES_ChecksumIPV4Header                 ((uint32_t)0x00400000)      ///< IPv4 header checksum insertion
#define ETH_DMA_TDES_ChecksumTCPUDPICMPSegment          ((uint32_t)0x00800000)      ///< TCP/UDP/ICMP checksum insertion. Pseudo header checksum is assumed to be present
#define ETH_DMA_TDES_ChecksumTCPUDPICMPFull             ((uint32_t)0x00C00000)      ///< TCP/UDP/ICMP checksum fully in hardware including pseudo header

#define ETH_DMA_RDES_Buffer1                            ((uint32_t)0x00000000)              ///< DMA Rx Desc Buffer1
#define ETH_DMA_RDES_Buffer2                            ((uint32_t)0x00000001)              ///< DMA Rx Desc Buffer2

#define ETH_DropTCPIPChecksumErrorFrame_Enable          ((uint32_t)0x00000000)
#define ETH_DropTCPIPChecksumErrorFrame_Disable         ((uint32_t)0x04000000)

#define ETH_ReceiveStoreForward_Enable                  ((uint32_t)0x02000000)
#define ETH_ReceiveStoreForward_Disable                 ((uint32_t)0x00000000)

#define ETH_FlushReceivedFrame_Enable                   ((uint32_t)0x00000000)
#define ETH_FlushReceivedFrame_Disable                  ((uint32_t)0x01000000)

#define ETH_TransmitStoreForward_Enable                 ((uint32_t)0x00200000)
#define ETH_TransmitStoreForward_Disable                ((uint32_t)0x00000000)

#define ETH_TransmitThresholdControl_64Bytes            ((uint32_t)0x00000000)      ///< threshold level of the MTL Transmit FIFO is 64 Bytes
#define ETH_TransmitThresholdControl_128Bytes           ((uint32_t)0x00004000)      ///< threshold level of the MTL Transmit FIFO is 128 Bytes
#define ETH_TransmitThresholdControl_192Bytes           ((uint32_t)0x00008000)      ///< threshold level of the MTL Transmit FIFO is 192 Bytes
#define ETH_TransmitThresholdControl_256Bytes           ((uint32_t)0x0000C000)      ///< threshold level of the MTL Transmit FIFO is 256 Bytes
#define ETH_TransmitThresholdControl_40Bytes            ((uint32_t)0x00010000)      ///< threshold level of the MTL Transmit FIFO is 40 Bytes
#define ETH_TransmitThresholdControl_32Bytes            ((uint32_t)0x00014000)      ///< threshold level of the MTL Transmit FIFO is 32 Bytes
#define ETH_TransmitThresholdControl_24Bytes            ((uint32_t)0x00018000)      ///< threshold level of the MTL Transmit FIFO is 24 Bytes
#define ETH_TransmitThresholdControl_16Bytes            ((uint32_t)0x0001C000)      ///< threshold level of the MTL Transmit FIFO is 16 Bytes

#define ETH_ForwardErrorFrames_Enable                   ((uint32_t)0x00000080)
#define ETH_ForwardErrorFrames_Disable                  ((uint32_t)0x00000000)

#define ETH_ForwardUndersizedGoodFrames_Enable          ((uint32_t)0x00000040)
#define ETH_ForwardUndersizedGoodFrames_Disable         ((uint32_t)0x00000000)

#define ETH_ReceiveThresholdControl_64Bytes             ((uint32_t)0x00000000)      ///< threshold level of the MTL Receive FIFO is 64 Bytes
#define ETH_ReceiveThresholdControl_32Bytes             ((uint32_t)0x00000008)      ///< threshold level of the MTL Receive FIFO is 32 Bytes
#define ETH_ReceiveThresholdControl_96Bytes             ((uint32_t)0x00000010)      ///< threshold level of the MTL Receive FIFO is 96 Bytes
#define ETH_ReceiveThresholdControl_128Bytes            ((uint32_t)0x00000018)      ///< threshold level of the MTL Receive FIFO is 128 Bytes

#define ETH_SecondFrameOperate_Enable       ((uint32_t)0x00000004)
#define ETH_SecondFrameOperate_Disable      ((uint32_t)0x00000000)

