ChenDudo/MM32-eMiniBoard-Demo/lib/HAL_lib/inc/hal_eth.h
#define ETH_AddressAlignedBeats_Enable      ((uint32_t)0x02000000)
#define ETH_AddressAlignedBeats_Disable     ((uint32_t)0x00000000)

#define ETH_FixedBurst_Enable               ((uint32_t)0x00010000)
#define ETH_FixedBurst_Disable              ((uint32_t)0x00000000)

#define ETH_RxDMABurstLength_1Beat          ((uint32_t)0x00020000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 1
#define ETH_RxDMABurstLength_2Beat          ((uint32_t)0x00040000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 2
#define ETH_RxDMABurstLength_4Beat          ((uint32_t)0x00080000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 4
#define ETH_RxDMABurstLength_8Beat          ((uint32_t)0x00100000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 8
#define ETH_RxDMABurstLength_16Beat         ((uint32_t)0x00200000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 16
#define ETH_RxDMABurstLength_32Beat         ((uint32_t)0x00400000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 32
#define ETH_RxDMABurstLength_4xPBL_4Beat    ((uint32_t)0x01020000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 4
#define ETH_RxDMABurstLength_4xPBL_8Beat    ((uint32_t)0x01040000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 8
#define ETH_RxDMABurstLength_4xPBL_16Beat   ((uint32_t)0x01080000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 16
#define ETH_RxDMABurstLength_4xPBL_32Beat   ((uint32_t)0x01100000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 32
#define ETH_RxDMABurstLength_4xPBL_64Beat   ((uint32_t)0x01200000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 64
#define ETH_RxDMABurstLength_4xPBL_128Beat  ((uint32_t)0x01400000)              ///< maximum number of beats to be transferred in one RxDMA transaction is 128

#define ETH_TxDMABurstLength_1Beat          ((uint32_t)0x00000100)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 1
#define ETH_TxDMABurstLength_2Beat          ((uint32_t)0x00000200)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 2
#define ETH_TxDMABurstLength_4Beat          ((uint32_t)0x00000400)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 4
#define ETH_TxDMABurstLength_8Beat          ((uint32_t)0x00000800)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 8
#define ETH_TxDMABurstLength_16Beat         ((uint32_t)0x00001000)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 16
#define ETH_TxDMABurstLength_32Beat         ((uint32_t)0x00002000)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 32
#define ETH_TxDMABurstLength_4xPBL_4Beat    ((uint32_t)0x01000100)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 4
#define ETH_TxDMABurstLength_4xPBL_8Beat    ((uint32_t)0x01000200)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 8
#define ETH_TxDMABurstLength_4xPBL_16Beat   ((uint32_t)0x01000400)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 16
#define ETH_TxDMABurstLength_4xPBL_32Beat   ((uint32_t)0x01000800)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 32
#define ETH_TxDMABurstLength_4xPBL_64Beat   ((uint32_t)0x01001000)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 64
#define ETH_TxDMABurstLength_4xPBL_128Beat  ((uint32_t)0x01002000)              ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 128

#define ETH_DMAArbitration_RoundRobin_RxTx_1_1      ((uint32_t)0x00000000)
#define ETH_DMAArbitration_RoundRobin_RxTx_2_1      ((uint32_t)0x00004000)
#define ETH_DMAArbitration_RoundRobin_RxTx_3_1      ((uint32_t)0x00008000)
#define ETH_DMAArbitration_RoundRobin_RxTx_4_1      ((uint32_t)0x0000C000)
#define ETH_DMAArbitration_RxPriorTx                ((uint32_t)0x00000002)

#define ETH_DMA_FLAG_TST                    ((uint32_t)0x20000000)              ///< Time-stamp trigger interrupt (on DMA)
#define ETH_DMA_FLAG_PMT                    ((uint32_t)0x10000000)              ///< PMT interrupt (on DMA)
#define ETH_DMA_FLAG_MMC                    ((uint32_t)0x08000000)              ///< MMC interrupt (on DMA)
#define ETH_DMA_FLAG_DataTransferError      ((uint32_t)0x00800000)              ///< Error bits 0-Rx DMA, 1-Tx DMA
#define ETH_DMA_FLAG_ReadWriteError         ((uint32_t)0x01000000)              ///< Error bits 0-write trnsf, 1-read transfr
#define ETH_DMA_FLAG_AccessError            ((uint32_t)0x02000000)              ///< Error bits 0-data buffer, 1-desc. access
#define ETH_DMA_FLAG_NIS                    ((uint32_t)0x00010000)              ///< Normal interrupt summary flag
#define ETH_DMA_FLAG_AIS                    ((uint32_t)0x00008000)              ///< Abnormal interrupt summary flag
#define ETH_DMA_FLAG_ER                     ((uint32_t)0x00004000)              ///< Early receive flag
#define ETH_DMA_FLAG_FBE                    ((uint32_t)0x00002000)              ///< Fatal bus error flag
#define ETH_DMA_FLAG_ET                     ((uint32_t)0x00000400)              ///< Early transmit flag
#define ETH_DMA_FLAG_RWT                    ((uint32_t)0x00000200)              ///< Receive watchdog timeout flag
#define ETH_DMA_FLAG_RPS                    ((uint32_t)0x00000100)              ///< Receive process stopped flag
#define ETH_DMA_FLAG_RBU                    ((uint32_t)0x00000080)              ///< Receive buffer unavailable flag
#define ETH_DMA_FLAG_R                      ((uint32_t)0x00000040)              ///< Receive flag
#define ETH_DMA_FLAG_TU                     ((uint32_t)0x00000020)              ///< Underflow flag
#define ETH_DMA_FLAG_RO                     ((uint32_t)0x00000010)              ///< Overflow flag
#define ETH_DMA_FLAG_TJT                    ((uint32_t)0x00000008)              ///< Transmit jabber timeout flag
#define ETH_DMA_FLAG_TBU                    ((uint32_t)0x00000004)              ///< Transmit buffer unavailable flag
#define ETH_DMA_FLAG_TPS                    ((uint32_t)0x00000002)              ///< Transmit process stopped flag
#define ETH_DMA_FLAG_T                      ((uint32_t)0x00000001)              ///< Transmit flag

#define ETH_DMA_IT_TST                      ((uint32_t)0x20000000)              ///< Time-stamp trigger interrupt (on DMA)
#define ETH_DMA_IT_PMT                      ((uint32_t)0x10000000)              ///< PMT interrupt (on DMA)
#define ETH_DMA_IT_MMC                      ((uint32_t)0x08000000)              ///< MMC interrupt (on DMA)
#define ETH_DMA_IT_NIS                      ((uint32_t)0x00010000)              ///< Normal interrupt summary
#define ETH_DMA_IT_AIS                      ((uint32_t)0x00008000)              ///< Abnormal interrupt summary
#define ETH_DMA_IT_ER                       ((uint32_t)0x00004000)              ///< Early receive interrupt
#define ETH_DMA_IT_FBE                      ((uint32_t)0x00002000)              ///< Fatal bus error interrupt
#define ETH_DMA_IT_ET                       ((uint32_t)0x00000400)              ///< Early transmit interrupt
#define ETH_DMA_IT_RWT                      ((uint32_t)0x00000200)              ///< Receive watchdog timeout interrupt
#define ETH_DMA_IT_RPS                      ((uint32_t)0x00000100)              ///< Receive process stopped interrupt
#define ETH_DMA_IT_RBU                      ((uint32_t)0x00000080)              ///< Receive buffer unavailable interrupt
#define ETH_DMA_IT_R                        ((uint32_t)0x00000040)              ///< Receive interrupt
#define ETH_DMA_IT_TU                       ((uint32_t)0x00000020)              ///< Underflow interrupt
#define ETH_DMA_IT_RO                       ((uint32_t)0x00000010)              ///< Overflow interrupt
#define ETH_DMA_IT_TJT                      ((uint32_t)0x00000008)              ///< Transmit jabber timeout interrupt
#define ETH_DMA_IT_TBU                      ((uint32_t)0x00000004)              ///< Transmit buffer unavailable interrupt
#define ETH_DMA_IT_TPS                      ((uint32_t)0x00000002)              ///< Transmit process stopped interrupt
#define ETH_DMA_IT_T                        ((uint32_t)0x00000001)              ///< Transmit interrupt

#define ETH_DMA_TransmitProcess_Stopped     ((uint32_t)0x00000000)              ///< Stopped - Reset or Stop Tx Command issued
#define ETH_DMA_TransmitProcess_Fetching    ((uint32_t)0x00100000)              ///< Running - fetching the Tx descriptor
#define ETH_DMA_TransmitProcess_Waiting     ((uint32_t)0x00200000)              ///< Running - waiting for status
#define ETH_DMA_TransmitProcess_Reading     ((uint32_t)0x00300000)              ///< Running - reading the data from host memory
#define ETH_DMA_TransmitProcess_Suspended   ((uint32_t)0x00600000)              ///< Suspended - Tx Descriptor unavailable
#define ETH_DMA_TransmitProcess_Closing     ((uint32_t)0x00700000)              ///< Running - closing Rx descriptor

#define ETH_DMA_ReceiveProcess_Stopped      ((uint32_t)0x00000000)              ///< Stopped - Reset or Stop Rx Command issued
#define ETH_DMA_ReceiveProcess_Fetching     ((uint32_t)0x00020000)              ///< Running - fetching the Rx descriptor
#define ETH_DMA_ReceiveProcess_Waiting      ((uint32_t)0x00060000)              ///< Running - waiting for packet
#define ETH_DMA_ReceiveProcess_Suspended    ((uint32_t)0x00080000)              ///< Suspended - Rx Descriptor unavailable
#define ETH_DMA_ReceiveProcess_Closing      ((uint32_t)0x000A0000)              ///< Running - closing descriptor
#define ETH_DMA_ReceiveProcess_Queuing      ((uint32_t)0x000E0000)              ///< Running - queuing the receive frame into host memory

#define ETH_DMA_Overflow_RxFIFOCounter      ((uint32_t)0x10000000)              ///< Overflow bit for FIFO overflow counter
#define ETH_DMA_Overflow_MissedFrameCounter ((uint32_t)0x00010000)              ///< Overflow bit for missed frame counter

////////////////////////////////////////////////////////////////////////////////
#define ETH_PMT_FLAG_WUFFRPR                ((uint32_t)0x80000000)              ///< Wake-Up Frame Filter Register Pointer Reset
#define ETH_PMT_FLAG_WUFR                   ((uint32_t)0x00000040)              ///< Wake-Up Frame Received
#define ETH_PMT_FLAG_MPR                    ((uint32_t)0x00000020)              ///< Magic Packet Received

////////////////////////////////////////////////////////////////////////////////
#define ETH_MMC_IT_TGF                      ((uint32_t)0x00200000)              ///< When Tx good frame counter reaches half the maximum value
#define ETH_MMC_IT_TGFMSC                   ((uint32_t)0x00008000)              ///< When Tx good multi col counter reaches half the maximum value
#define ETH_MMC_IT_TGFSC                    ((uint32_t)0x00004000)              ///< When Tx good single col counter reaches half the maximum value

#define ETH_MMC_IT_RGUF                     ((uint32_t)0x10020000)              ///< When Rx good unicast frames counter reaches half the maximum value
#define ETH_MMC_IT_RFAE                     ((uint32_t)0x10000040)              ///< When Rx alignment error counter reaches half the maximum value
#define ETH_MMC_IT_RFCE                     ((uint32_t)0x10000020)              ///< When Rx crc error counter reaches half the maximum value

