ChenDudo/MM32-eMiniBoard-Demo/lib/HAL_lib/inc/hal_eth.h
#define ETH_MMCCR                           ((uint32_t)0x00000100)              ///< MMC CR register
#define ETH_MMCRIR                          ((uint32_t)0x00000104)              ///< MMC RIR register
#define ETH_MMCTIR                          ((uint32_t)0x00000108)              ///< MMC TIR register
#define ETH_MMCRIMR                         ((uint32_t)0x0000010C)              ///< MMC RIMR register
#define ETH_MMCTIMR                         ((uint32_t)0x00000110)              ///< MMC TIMR register
#define ETH_MMCTGFSCCR                      ((uint32_t)0x0000014C)              ///< MMC TGFSCCR register
#define ETH_MMCTGFMSCCR                     ((uint32_t)0x00000150)              ///< MMC TGFMSCCR register
#define ETH_MMCTGFCR                        ((uint32_t)0x00000168)              ///< MMC TGFCR register
#define ETH_MMCRFCECR                       ((uint32_t)0x00000194)              ///< MMC RFCECR register
#define ETH_MMCRFAECR                       ((uint32_t)0x00000198)              ///< MMC RFAECR register
#define ETH_MMCRGUFCR                       ((uint32_t)0x000001C4)              ///< MMC RGUFCR register

////////////////////////////////////////////////////////////////////////////////
#define ETH_PTP_FineUpdate                  ((uint32_t)0x00000001)              ///< Fine Update method
#define ETH_PTP_CoarseUpdate                ((uint32_t)0x00000000)              ///< Coarse Update method

#define ETH_PTP_FLAG_TSARU                  ((uint32_t)0x00000020)              ///< Addend Register Update
#define ETH_PTP_FLAG_TSITE                  ((uint32_t)0x00000010)              ///< Time Stamp Interrupt Trigger
#define ETH_PTP_FLAG_TSSTU                  ((uint32_t)0x00000008)              ///< Time Stamp Update
#define ETH_PTP_FLAG_TSSTI                  ((uint32_t)0x00000004)              ///< Time Stamp Initialize

#define ETH_PTP_FLAG_TSTTR                  ((uint32_t)0x10000002)              ///< Time stamp target time reached
#define ETH_PTP_FLAG_TSSO                   ((uint32_t)0x10000001)              ///< Time stamp seconds overflow

#define ETH_PTP_PositiveTime                ((uint32_t)0x00000000)              ///< Positive time value
#define ETH_PTP_NegativeTime                ((uint32_t)0x80000000)              ///< Negative time value

#define ETH_PTPTSCR                         ((uint32_t)0x00000700)              ///< PTP TSCR register
#define ETH_PTPSSIR                         ((uint32_t)0x00000704)              ///< PTP SSIR register
#define ETH_PTPTSHR                         ((uint32_t)0x00000708)              ///< PTP TSHR register
#define ETH_PTPTSLR                         ((uint32_t)0x0000070C)              ///< PTP TSLR register
#define ETH_PTPTSHUR                        ((uint32_t)0x00000710)              ///< PTP TSHUR register
#define ETH_PTPTSLUR                        ((uint32_t)0x00000714)              ///< PTP TSLUR register
#define ETH_PTPTSAR                         ((uint32_t)0x00000718)              ///< PTP TSAR register
#define ETH_PTPTTHR                         ((uint32_t)0x0000071C)              ///< PTP TTHR register
#define ETH_PTPTTLR                         ((uint32_t)0x00000720)              ///< PTP TTLR register

#define ETH_PTPTSSR                         ((uint32_t)0x00000728)              ///< PTP TSSR register

#define ETH_PTP_OrdinaryClock               ((uint32_t)0x00000000)              ///< Ordinary Clock
#define ETH_PTP_BoundaryClock               ((uint32_t)0x00010000)              ///< Boundary Clock
#define ETH_PTP_EndToEndTransparentClock    ((uint32_t)0x00020000)              ///< End To End Transparent Clock
#define ETH_PTP_PeerToPeerTransparentClock  ((uint32_t)0x00030000)              ///< Peer To Peer Transparent Clock

#define ETH_PTP_SnapshotMasterMessage               ((uint32_t)0x00008000)      ///< Time stamp snapshot for message relevant to master enable
#define ETH_PTP_SnapshotEventMessage                ((uint32_t)0x00004000)      ///< Time stamp snapshot for event message enable
#define ETH_PTP_SnapshotIPV4Frames                  ((uint32_t)0x00002000)      ///< Time stamp snapshot for IPv4 frames enable
#define ETH_PTP_SnapshotIPV6Frames                  ((uint32_t)0x00001000)      ///< Time stamp snapshot for IPv6 frames enable
#define ETH_PTP_SnapshotPTPOverEthernetFrames       ((uint32_t)0x00000800)      ///< Time stamp snapshot for PTP over ethernet frames enable
#define ETH_PTP_SnapshotAllReceivedFrames           ((uint32_t)0x00000100)      ///< Time stamp snapshot for all received frames enable

#define ETH_MAC_ADDR_HBASE      (ETH_BASE + 0x40)                               ///< ETHERNET MAC address high offset
#define ETH_MAC_ADDR_LBASE      (ETH_BASE + 0x44)                               ///< ETHERNET MAC address low offset

#define MACMIIAR_CR_MASK    ((uint32_t)0xFFFFFFE3)

#define MACCR_CLEAR_MASK    ((uint32_t)0xFF20810F)
#define MACFCR_CLEAR_MASK   ((uint32_t)0x0000FF41)
#define DMAOMR_CLEAR_MASK   ((uint32_t)0xF8DE3F23)



GLOBAL __IO ETH_DMADESCTypeDef*  DMATxDescToSet;
GLOBAL __IO ETH_DMADESCTypeDef*  DMARxDescToGet;

GLOBAL ETH_DMA_Rx_Frame_infos RX_Frame_Descriptor;
GLOBAL __IO ETH_DMA_Rx_Frame_infos* DMA_RX_FRAME_infos;
GLOBAL __IO uint32_t Frame_Rx_index;

#undef GLOBAL

void ETH_DeInit(void);
void ETH_StructInit(ETH_InitTypeDef* ptr);
uint32_t ETH_Init(ETH_InitTypeDef* ptr, uint16_t phy_addr);
void ETH_Start(void);
void ETH_Stop(void);
void ETH_MACTransmissionCmd(FunctionalState sta);
void ETH_MACReceptionCmd(FunctionalState sta);
FlagStatus ETH_GetFlowControlBusyStatus(void);
void ETH_InitiatePauseControlFrame(void);
void ETH_BackPressureActivationCmd(FunctionalState sta);
void ETH_MACAddressConfig(uint32_t reg_addr, uint8_t* mac_addr);
void ETH_GetMACAddress(uint32_t reg_addr, uint8_t* mac_addr);
void ETH_MACAddressPerfectFilterCmd(uint32_t reg_addr, FunctionalState sta);
void ETH_MACAddressFilterConfig(uint32_t reg_addr, uint32_t sta);
void ETH_MACAddressMaskBytesFilterConfig(uint32_t reg_addr, uint32_t mask_byte);
FrameTypeDef ETH_Get_Received_Frame(void);
FrameTypeDef ETH_Get_Received_Frame_interrupt(void);
uint32_t ETH_Prepare_Transmit_Descriptors(u16 len);
void ETH_DMARxDescChainInit(ETH_DMADESCTypeDef* ptr_desc, uint8_t* buf, uint32_t cnt);
uint32_t ETH_CheckFrameReceived(void);
void ETH_DMATxDescChainInit(ETH_DMADESCTypeDef* ptr_desc, uint8_t* buf, uint32_t cnt);
FlagStatus ETH_GetDMATxDescFlagStatus(ETH_DMADESCTypeDef* ptr_desc, uint32_t flag);
uint32_t ETH_GetDMATxDescCollisionCount(ETH_DMADESCTypeDef* ptr_desc);
void ETH_SetDMATxDescOwnBit(ETH_DMADESCTypeDef* ptr_desc);
void ETH_DMATxDescTransmitITConfig(ETH_DMADESCTypeDef* ptr_desc, FunctionalState sta);
void ETH_DMATxDescFrameSegmentConfig(ETH_DMADESCTypeDef* ptr_desc, uint32_t val);
void ETH_DMATxDescChecksumInsertionConfig(ETH_DMADESCTypeDef* ptr_desc, uint32_t val);
void ETH_DMATxDescCRCCmd(ETH_DMADESCTypeDef* ptr_desc, FunctionalState sta);
void ETH_DMATxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef* ptr_desc, FunctionalState sta);
void ETH_DMATxDescShortFramePaddingCmd(ETH_DMADESCTypeDef* ptr_desc, FunctionalState sta);
void ETH_DMATxDescBufferSizeConfig(ETH_DMADESCTypeDef* ptr_desc, uint32_t buf1_size, uint32_t buf2_size);
FlagStatus ETH_GetDMARxDescFlagStatus(ETH_DMADESCTypeDef* ptr_desc, uint32_t flag);
void ETH_SetDMARxDescOwnBit(ETH_DMADESCTypeDef* ptr_desc);
uint32_t ETH_GetDMARxDescFrameLength(ETH_DMADESCTypeDef* ptr_desc);
void ETH_DMARxDescReceiveITConfig(ETH_DMADESCTypeDef* ptr_desc, FunctionalState sta);
uint32_t ETH_GetDMARxDescBufferSize(ETH_DMADESCTypeDef* ptr_desc, uint32_t buf);
uint32_t ETH_GetRxPktSize(ETH_DMADESCTypeDef* ptr_desc);
void ETH_SoftwareReset(void);
FlagStatus ETH_GetSoftwareResetStatus(void);
FlagStatus ETH_GetDMAFlagStatus(uint32_t flag);
void ETH_DMAClearFlag(uint32_t flag);
void ETH_DMAITConfig(uint32_t it, FunctionalState sta);
ITStatus ETH_GetDMAITStatus(uint32_t it);
void ETH_DMAClearITPendingBit(uint32_t it);
uint32_t ETH_GetTransmitProcessState(void);
uint32_t ETH_GetReceiveProcessState(void);
void ETH_FlushTransmitFIFO(void);
FlagStatus ETH_GetFlushTransmitFIFOStatus(void);
void ETH_DMATransmissionCmd(FunctionalState sta);
void ETH_DMAReceptionCmd(FunctionalState sta);
FlagStatus ETH_GetDMAOverflowStatus(uint32_t val);
uint32_t ETH_GetRxOverflowMissedFrameCounter(void);
uint32_t ETH_GetBufferUnavailableMissedFrameCounter(void);
uint32_t ETH_GetCurrentTxDescStartAddress(void);
uint32_t ETH_GetCurrentRxDescStartAddress(void);
uint32_t ETH_GetCurrentTxBufferAddress(void);
uint32_t ETH_GetCurrentRxBufferAddress(void);
void ETH_ResumeDMATransmission(void);
void ETH_ResumeDMAReception(void);
void ETH_SetReceiveWatchdogTimer(uint8_t val);
uint16_t ETH_ReadPHYRegister(uint16_t addr, uint16_t reg);
uint16_t ETH_WritePHYRegister(uint16_t addr, uint16_t reg, uint16_t val);
uint32_t ETH_PHYLoopBackCmd(uint16_t addr, FunctionalState sta);
void ETH_ResetWakeUpFrameFilterRegisterPointer(void);
void ETH_SetWakeUpFrameFilterRegister(uint32_t* buf);
void ETH_GlobalUnicastWakeUpCmd(FunctionalState sta);
FlagStatus ETH_GetPMTFlagStatus(uint32_t flag);
void ETH_WakeUpFrameDetectionCmd(FunctionalState sta);
void ETH_MagicPacketDetectionCmd(FunctionalState sta);
void ETH_PowerDownCmd(FunctionalState sta);
void ETH_MMCCounterFullPreset(void);
void ETH_MMCCounterHalfPreset(void);
void ETH_MMCCounterFreezeCmd(FunctionalState sta);
void ETH_MMCResetOnReadCmd(FunctionalState sta);
void ETH_MMCCounterRolloverCmd(FunctionalState sta);
void ETH_MMCCountersReset(void);
void ETH_MMCITConfig(uint32_t it, FunctionalState sta);
ITStatus ETH_GetMMCITStatus(uint32_t it);
uint32_t ETH_GetMMCRegister(uint32_t reg);

#endif
